Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

source: Here's your academic progress
ja: 最近の学習状況
ko: 최근 학습 현황
zh_hans: 你的近期学习概况
zh_hant: 你的近期學習概況

source: Hide Preview
ja: プレビューを隠す
ko: 미리보기 숨기기
zh_hans: 隐藏预览
zh_hant: 隱藏預覽

source: HIGH
ja: 高
ko: 높음
zh_hans: 高
zh_hant: 高

source: High HRV → well-rested, ready to learn
ja: HRV が高い → 十分に休息が取れ、学習の準備ができている
ko: HRV 높음 → 충분히 휴식, 학습 준비 완료
zh_hans: HRV 高 → 充分休息，准备好学习
zh_hant: HRV 高 → 充分休息，準備好學習

source: High School
ja: 高校
ko: 고등학교
zh_hans: 高中
zh_hant: 高中

source: Highest
ja: 最高
ko: 최고
zh_hans: 最高
zh_hant: 最高

source: History
ja: 履歴
ko: 이력
zh_hans: 历史
zh_hant: 歷史

source: History & Society
ja: 歴史と社会
ko: 역사와 사회
zh_hans: 历史与社会
zh_hant: 歷史與社會

source: Home
ja: ホーム
ko: 홈
zh_hans: 主页
zh_hant: 首頁

source: Home Cards
ja: ホームカード
ko: 홈 카드
zh_hans: 主页卡片
zh_hant: 主頁卡片

source: Home Layout
ja: ホームレイアウト
ko: 홈 화면 레이아웃
zh_hans: 主页布局
zh_hant: 主頁佈局

# homeLayout.footer
source: Drag to reorder. Toggle off to hide. Full-width cards like the Learning Heatmap always span the entire row on iPad.
ja: ドラッグで並べ替え。スイッチで非表示にできます。学習ヒートマップなどのフル幅カードは iPad で常に 1 行を占めます。
ko: 드래그하여 순서 변경, 스위치로 숨기기 가능. 학습 히트맵 같은 전체 너비 카드는 iPad에서 항상 한 줄을 차지합니다.
zh_hans: 拖动可重新排序，关闭开关即可隐藏。宽幅卡片（如学习热力图）在 iPad 上始终独占整行。
zh_hant: 拖動可重新排序，關閉開關即可隱藏。寬幅卡片（如學習熱力圖）在 iPad 上始終獨佔整行。

source: Homework
ja: 宿題
ko: 숙제
zh_hans: 作业
zh_hant: 作業

source: How do I add a mistake note with photos?
ja: 写真付きの間違いノートを追加するにはどうすればよいですか？
ko: 사진이 포함된 오답 노트를 추가하려면 어떻게 하나요？
zh_hans: 如何添加带有照片的错题？
zh_hant: 如何添加帶有照片的錯題？

source: How do I export my data?
ja: データをエクスポートするにはどうすればよいですか？
ko: 데이터를 내보내려면 어떻게 하나요？
zh_hans: 如何导出我的数据？
zh_hant: 如何匯出我的數據？

source: How does StudyPulse track my grades?
ja: StudyPulseはどのように成績を管理しますか？
ko: StudyPulse는 성적을 어떻게 추적하나요？
zh_hans: StudyPulse 如何追踪我的成绩？
zh_hant: StudyPulse 如何追蹤我的成績？

source: How old are you?
ja: 何歳ですか？
ko: 올해 몇 살인가요?
zh_hans: 你今年多大？
zh_hant: 你今年幾歲？

source: How to contribute to the open source project, code of conduct, and submission process.
ja: オープンソースプロジェクトへの貢献方法、行為規範、提出プロセスをご案内します。
ko: 오픈 소스 프로젝트 기여 방법, 행동 강령 및 제출 절차를 안내합니다.
zh_hans: 了解如何参与开源项目、贡献者行为准则与提交流程。
zh_hant: 了解如何參與開源項目、貢獻者行為準則與提交流程。

source: How to Reach Your Target
ja: 目標達成のために
ko: 목표 달성 방법
zh_hans: 如何达到你的目标
zh_hant: 如何達到你的目標

source: How well did you remember?
ja: どのくらい覚えていましたか？
ko: 얼마나 잘 기억하나요?
zh_hans: 你掌握得如何？
zh_hant: 你掌握得如何？

source: HRV · Recovery · Focus
ja: 心拍変動 · 回復 · 集中
ko: 심박변이도 · 회복 · 집중
zh_hans: 心率变异 · 恢复 · 专注
zh_hant: 心率變異 · 恢復 · 專注

source: HRV Card Detail
ja: HRV カードの詳細
ko: HRV 카드 상세
zh_hans: HRV 卡片详情
zh_hant: HRV 卡片詳情

source: HRV data is read directly from Apple Health
ja: HRV データは Apple ヘルスケアから直接読み取られます
ko: HRV 데이터는 Apple 건강 앱에서 직접 읽습니다
zh_hans: HRV 数据直接从 Apple 健康读取
zh_hant: HRV 資料直接從 Apple 健康讀取

source: HRV is low — go for a light review or a walk.
ja: HRV が低めです。軽い復習や散歩を。
ko: HRV 가 낮아요. 가벼운 복습이나 산책을 권합니다.
zh_hans: HRV 偏低,做点轻量复习或散步。
zh_hant: HRV 偏低,做點輕量複習或散步。

source: HRV is read from Apple Health with your permission. Your data stays on device and is never uploaded.
ja: HRV はあなたの許可のもと Apple ヘルスケアから読み取られます。データは端末上にのみ保持され、アップロードされません。
ko: HRV는 귀하의 허가하에 Apple 건강에서 읽습니다. 데이터는 기기에만 저장되며 업로드되지 않습니다.
zh_hans: HRV 在你许可下从 Apple 健康读取。数据只保留在你的设备上，绝不上传。
zh_hant: HRV 在你許可下從 Apple 健康讀取。資料只保留在你的裝置上，絕不上傳。

source: HRV Monitoring
ja: HRV モニタリング
ko: HRV 모니터링
zh_hans: HRV 监测
zh_hant: HRV 監測

source: HRV Onboarding
ja: HRV はじめに
ko: HRV 시작하기
zh_hans: HRV 引导
zh_hant: HRV 引導

source: HRV Performance
ja: HRVパフォーマンス
ko: HRV 성과
zh_hans: HRV 表现
zh_hant: HRV 表現

source: HRV Readiness
ja: HRV 準備度
ko: HRV 준비도
zh_hans: HRV 准备度
zh_hant: HRV 準備度

source: I forgot
ja: 忘れた
ko: 잊었음
zh_hans: 忘了
zh_hant: 忘了

source: I remembered
ja: 覚えた
ko: 기억함
zh_hans: 记得
zh_hant: 記得

source: If you see this, notifications are working.
ja: これが表示されていれば通知は正常に動作しています。
ko: 이 알림이 보이면 알림 기능이 정상입니다.
zh_hans: 如果你看到这条通知，说明通知功能正常。
zh_hant: 如果你看到這則通知，代表通知功能正常。

source: Ignore
ja: 無視
ko: 무시
zh_hans: 忽略
zh_hant: 忽略

source: Ignored
ja: 無視済み
ko: 무시됨
zh_hans: 已忽略
zh_hant: 已忽略

source: Image Cache
ja: 画像キャッシュ
ko: 이미지 캐시
zh_hans: 图片缓存
zh_hant: 圖片快取

source: Image Quality
ja: 画質
ko: 이미지 품질
zh_hans: 图片质量
zh_hant: 圖片品質

source: Images
ja: 画像
ko: 이미지
zh_hans: 图片
zh_hant: 圖片

source: Images embedded in each section will be included. Larger PDF size.
ja: 各セクションに含まれる画像も埋め込みます。PDF のサイズが大きくなります。
ko: 각 섹션의 이미지도 포함됩니다. PDF 크기가 커집니다.
zh_hans: 会包含每个段落里的图片，PDF 体积会更大。
zh_hant: 會包含每個段落裡的圖片，PDF 體積會更大。

source: Import · Export · Backup
ja: インポート · エクスポート · バックアップ
ko: 가져오기 · 내보내기 · 백업
zh_hans: 导入 · 导出 · 备份
zh_hant: 匯入 · 匯出 · 備份

source: Import / Export Data
ja: データのインポート / エクスポート
ko: 데이터 가져오기 / 내보내기
zh_hans: 导入 / 导出数据
zh_hant: 匯入 / 匯出資料

source: Import Data
ja: データをインポート
ko: 데이터 가져오기
zh_hans: 导入数据
zh_hant: 匯入資料

source: Import Error
ja: インポートエラー
ko: 가져오기 오류
zh_hans: 导入错误
zh_hant: 匯入錯誤

source: Import Success
ja: インポート成功
ko: 가져오기 성공
zh_hans: 导入成功
zh_hant: 匯入成功

source: Import, export and manage your grades, mistakes and exams data.
ja: 成績、間違いノート、試験データのインポート、エクスポート、管理を行います。
ko: 성적, 오답 노트, 시험 데이터를 가져오기, 내보내기 및 관리합니다.
zh_hans: 导入、导出与管理你的成绩、错题与考试数据。
zh_hant: 匯入、匯出與管理你的成績、錯題與考試資料。

# import.error.E001
source: Cannot read file
ja: ファイルを読み込めません
ko: 파일을 읽을 수 없음
zh_hans: 无法读取文件
zh_hant: 無法讀取檔案

# import.error.E002
source: Empty CSV
ja: CSV が空です
ko: CSV 비어있음
zh_hans: CSV 为空
zh_hant: CSV 為空

# import.error.E003
source: No data rows (header only)
ja: データ行がありません(ヘッダーのみ)
ko: 데이터 행 없음(헤더만)
zh_hans: 无数据行(仅表头)
zh_hant: 無資料列(僅表頭)

# import.error.E004
source: All rows failed to parse
ja: すべての行の解析に失敗
ko: 모든 행 파싱 실패
zh_hans: 全部行解析失败
zh_hant: 全部列解析失敗

# import.error.E005
source: Some rows skipped
ja: 一部の行をスキップ
ko: 일부 행 건너뜀
zh_hans: 部分行解析失败
zh_hant: 部分列解析失敗

# import.error.E101
source: Header columns do not match expected schema
ja: ヘッダーが期待スキーマと一致しません
ko: 헤더가 예상 스키마와 일치하지 않음
zh_hans: 表头与期望 schema 不匹配
zh_hant: 表頭與期望 schema 不符

# import.error.E102
source: Header has fewer columns than expected
ja: ヘッダー列数が期待より少ない
ko: 헤더 열 수가 기대값보다 적음
zh_hans: 表头列数少于期望值
zh_hant: 表頭欄位少於期望

# import.error.E201
source: Required field missing or invalid
ja: 必須フィールドが欠落または不正
ko: 필수 필드 누락 또는 잘못됨
zh_hans: 必填字段缺失或非法
zh_hant: 必填欄位缺失或不合法

# import.error.E202
source: Numeric field has invalid format
ja: 数値フィールドの形式が不正
ko: 숫자 필드 형식이 잘못됨
zh_hans: 数值字段格式非法
zh_hant: 數值欄位格式不合法

# import.error.E203
source: Type enum value is invalid
ja: Type 列挙値が不正
ko: Type 열거값이 잘못됨
zh_hans: 类型枚举值非法
zh_hant: 類型列舉值不合法

# import.error.E301
source: Failed to save to database
ja: データベースへの保存に失敗
ko: 데이터베이스 저장 실패
zh_hans: 写入数据库失败
zh_hant: 寫入資料庫失敗

source: Importance
ja: 重要度
ko: 중요도
zh_hans: 重要程度
zh_hant: 重要程度

source: Improving
ja: 向上中
ko: 향상 중
zh_hans: 进步中
zh_hant: 進步中

source: In %d days
ja: %d 日後
ko: %d일 후
zh_hans: %d 天后
zh_hant: %d 天後

source: Include body status history
ja: 身体状態の履歴を含める
ko: 신체 상태 기록 포함
zh_hans: 包含身体状态历史
zh_hant: 包含身體狀態歷史

source: Include Images
ja: 画像を含む
ko: 이미지 포함
zh_hans: 包含图片
zh_hant: 包含圖片

source: Include media files
ja: メディアファイルを含める
ko: 미디어 파일 포함
zh_hans: 包含媒体文件
zh_hant: 包含媒體檔案

source: Included
ja: 含む
ko: 포함됨
zh_hans: 已包含
zh_hant: 已包含

source: Independent Conversations
ja: 独立した会話
ko: 독립 대화
zh_hans: 独立对话
zh_hant: 獨立對話

source: Indigo
ja: インディゴ
ko: 인디고
zh_hans: 靛蓝
zh_hant: 靛藍

source: Information Technology
ja: 情報技術
ko: 정보 기술
zh_hans: 信息技术
zh_hant: 資訊科技

source: Insert into Correct
ja: 正解欄に挿入
ko: 정답에 삽입
zh_hans: 填入正解
zh_hant: 填入正解

source: Integrity
ja: 整合性
ko: 무결성
zh_hans: 完整性
zh_hant: 完整性

source: International
ja: 国際
ko: 국제
zh_hans: 国际
zh_hant: 國際

source: International High School
ja: 国際高校
ko: 국제 고등학교
zh_hans: 国际高中
zh_hant: 國際高中

source: International HS
ja: 国際高校
ko: 국제 고등학교
zh_hans: 国际高中
zh_hant: 國際高中

source: Intl. %@
ja: 国際 %@
ko: 국제 %@
zh_hans: 国际 %@
zh_hant: 國際 %@

source: Intuitive visualization of your trends.
ja: 直感的に推移を確認できます。
ko: 추세를 직관적으로 시각화합니다.
zh_hans: 以直观的形式了解趋势。
zh_hant: 以直觀的形式了解趨勢。

source: Invalid Base URL.
ja: エンドポイント URL が無効です。
ko: 엔드포인트 URL이 잘못되었습니다。
zh_hans: API 端点 URL 无效。
zh_hant: API 端點 URL 無效。

source: It was tough
ja: 難しかった
ko: 어려웠다
zh_hans: 很吃力
zh_hant: 很吃力

source: Item
ja: 項目
ko: 항목
zh_hans: 项目
zh_hant: 項目

source: item(s)
ja: 件
ko: 개
zh_hans: 条
zh_hant: 條

# JSON 长度:%d chars
source: JSON length: %d chars
ja: JSON 長さ: %d chars
ko: JSON 길이: %d chars
zh_hans: JSON 长度:%d chars
zh_hant: JSON 長度:%d chars

source: Keep Drawing
ja: <#ja#>
ko: <#ko#>
zh_hans: 继续画
zh_hant: <#zh-Hant#>

source: Keep studying for a few more days to unlock insights.
ja: あと数日学習すると洞察を利用できます。
ko: 며칠 더 공부하면 인사이트가 열립니다.
zh_hans: 再坚持几天学习，即可解锁习惯洞察。
zh_hant: 再持續學習幾天，即可解鎖習慣洞察。

source: Keep the streak going!
ja: 記録を続けましょう！
ko: 기록 습관을 유지하세요!
zh_hans: 保持记录习惯！
zh_hant: 保持記錄習慣！

source: Keep the timer visible while reducing distractions.
ja: タイマーを常に見える状態に保ち、気が散る要素を減らします。
ko: 타이머를 계속 보이게 유지하면서 방해 요소를 줄입니다.
zh_hans: 保持计时器始终可见，同时减少干扰。
zh_hant: 保持計時器持續可見，同時減少干擾。

source: Keep Unassigned
ja: 未分類のまま
ko: 미분류로 유지
zh_hans: 保持未归类
zh_hant: 保持未歸類

source: Keep up the good work
ja: この調子で
ko: 이 기세로 계속
zh_hans: 继续加油
zh_hant: 繼續加油

source: Keep up the good work! You're performing really well in this subject.
ja: その調子で！この科目の成績は非常に良いです。
ko: 잘하고 있어요! 이 과목에서 정말 좋은 성적을 내고 있습니다.
zh_hans: 继续保持！你在这门科目的表现非常好。
zh_hant: 繼續保持！你在這門科目的表現非常好。

source: Key Stats
ja: 主要統計
ko: 주요 통계
zh_hans: 关键统计
zh_hant: 關鍵統計

source: Knowledge Coverage
ja: 知識カバー率
ko: 지식 범위
zh_hans: 知识点覆盖
zh_hant: 知識點覆蓋

# knowledge.fault.ai.autoHint
source: AI updates automatically after 5 new mistakes; you can also run it manually.
ja: 新しい間違いが 5 問増えると自動更新します。手動実行もできます。
ko: 새 오답이 5개 추가되면 자동으로 업데이트하며, 수동 실행도 가능합니다.
zh_hans: 每新增 5 道错题自动更新，也可以手动运行。
zh_hant: 每新增 5 道錯題自動更新，也可以手動執行。

# knowledge.fault.ai.fallback
source: Using local rule-based inference
ja: ローカルルールによる推定を使用中
ko: 로컬 규칙 추론을 사용 중입니다
zh_hans: 当前使用本地规则推断
zh_hant: 目前使用本地規則推斷

# knowledge.fault.ai.loading
source: AI is extracting concepts…
ja: AI が概念を抽出しています…
ko: AI가 개념을 추출하는 중…
zh_hans: AI 正在提取知识点…
zh_hant: AI 正在提取知識點…

# knowledge.fault.ai.manual
source: Run AI scan now
ja: 今すぐ AI スキャンを実行
ko: 지금 AI 스캔 실행
zh_hans: 立即运行 AI 扫描
zh_hant: 立即執行 AI 掃描

# knowledge.fault.category.concept_definition.title
source: Concepts and definitions
ja: 概念と定義
ko: 개념과 정의
zh_hans: 概念与定义
zh_hant: 概念與定義

# knowledge.fault.category.condition_boundary.title
source: Conditions and boundaries
ja: 条件と境界
ko: 조건과 경계
zh_hans: 条件与边界
zh_hant: 條件與邊界

# knowledge.fault.category.equation_modeling.title
source: Equation modeling
ja: 方程式モデリング
ko: 방정식 모델링
zh_hans: 方程建模
zh_hant: 方程建模

# knowledge.fault.category.foundational_memory.title
source: Foundational memory
ja: 基礎記憶
ko: 기초 기억
zh_hans: 基础记忆
zh_hant: 基礎記憶

# knowledge.fault.category.method_selection.title
source: Method selection
ja: 方法の選択
ko: 방법 선택
zh_hans: 方法选择
zh_hant: 方法選擇

# knowledge.fault.category.other.title
source: Other foundation
ja: その他の基礎
ko: 기타 기초 능력
zh_hans: 其他基础能力
zh_hant: 其他基礎能力

# knowledge.fault.category.proportional_reasoning.title
source: Proportional reasoning
ja: 比例関係
ko: 비례 관계
zh_hans: 比例关系
zh_hant: 比例關係

# knowledge.fault.category.reading_translation.title
source: Reading and translation
ja: 読解と翻訳
ko: 문제 읽기와 해석
zh_hans: 审题转译
zh_hant: 審題轉譯

# knowledge.fault.category.symbolic_calculation.title
source: Symbolic calculation
ja: 記号計算
ko: 기호 계산
zh_hans: 符号计算
zh_hant: 符號計算

# knowledge.fault.category.unit_conversion.title
source: Unit conversion
ja: 単位換算
ko: 단위 변환
zh_hans: 单位换算
zh_hant: 單位換算

# knowledge.fault.chain.accessibility
source: %@ leads through prerequisites to %@
ja: %@ が前提概念を通じて %@ につながります
ko: %@이(가) 선행 개념을 거쳐 %@로 연결됩니다
zh_hans: %@ 经过前置概念连接到 %@
zh_hant: %@ 經過前置概念連接到 %@

# knowledge.fault.chain.foundation
source: Foundation
ja: 基礎の断層
ko: 기초 단절
zh_hans: 底层断层
zh_hant: 底層斷層

# knowledge.fault.chain.prerequisite
source: Prerequisite
ja: 前提概念
ko: 선행 개념
zh_hans: 前置概念
zh_hant: 前置概念

# knowledge.fault.chain.section
source: Knowledge chain
ja: 知識のつながり
ko: 지식 연결
zh_hans: 知识链路
zh_hant: 知識鏈路

# knowledge.fault.chain.target
source: Question concept
ja: 問題の知識点
ko: 문제 지식점
zh_hans: 题目知识点
zh_hant: 題目知識點

# knowledge.fault.depth.section
source: Deep reason
ja: 深い原因
ko: 깊은 원인
zh_hans: 深层原因
zh_hant: 深層原因

# knowledge.fault.depth.summary
source: %@ may depend on %@
ja: %@ は %@ に依存している可能性があります
ko: %@은(는) %@에 의존할 수 있습니다
zh_hans: %@ 可能依赖 %@
zh_hant: %@ 可能依賴 %@

# knowledge.fault.depth.title
source: Scan the deeper cause
ja: より深い原因をスキャン
ko: 더 깊은 원인 스캔
zh_hans: 扫描更深层原因
zh_hant: 掃描更深層原因

# knowledge.fault.detail.noChain
source: There is not enough information to form a chain yet.
ja: 情報が足りないため、まだ完全なつながりを作れません。
ko: 정보가 부족해 아직 완전한 연결을 만들 수 없습니다.
zh_hans: 当前信息不足，暂时无法形成完整链路。
zh_hant: 目前資訊不足，暫時無法形成完整鏈路。

# knowledge.fault.detail.title
source: Deep reason
ja: 深い原因
ko: 깊은 원인
zh_hans: 深层原因
zh_hant: 深層原因

# knowledge.fault.empty.message
source: Add a mistake note to start scanning prerequisite gaps.
ja: 間違いノートを追加すると、前提知識の不足をスキャンできます。
ko: 오답 노트를 추가하면 선행 지식의 빈틈을 스캔할 수 있습니다.
zh_hans: 新增错题后即可开始扫描前置知识缺口。
zh_hant: 新增錯題後即可開始掃描前置知識缺口。

# knowledge.fault.empty.title
source: No knowledge scan yet
ja: 知識の断層はまだありません
ko: 아직 지식 단절이 없습니다
zh_hans: 还没有知识断层
zh_hant: 還沒有知識斷層

# knowledge.fault.home.empty
source: Keep recording mistakes to reveal repeated prerequisite gaps.
ja: 間違いを記録し続けると、繰り返す前提知識の不足が表示されます。
ko: 오답을 계속 기록하면 반복되는 선행 지식의 빈틈이 표시됩니다.
zh_hans: 继续记录错题，重复出现的前置知识缺口会在这里显示。
zh_hant: 繼續記錄錯題，重複出現的前置知識缺口會在這裡顯示。

# knowledge.fault.home.risk
source: Risk %d%%
ja: リスク %d%%
ko: 위험도 %d%%
zh_hans: 风险 %d%%
zh_hant: 風險 %d%%

# knowledge.fault.home.summary
source: %@ affects %d mistakes
ja: %@ が %d 問に影響
ko: %@이(가) %d개 오답에 영향을 줍니다
zh_hans: %@ 影响 %d 道错题
zh_hant: %@ 影響 %d 道錯題

# knowledge.fault.home.title
source: Your knowledge fault lines
ja: あなたの知識の断層
ko: 나의 지식 단절
zh_hans: 你的知识断层
zh_hant: 你的知識斷層

# knowledge.fault.metric.impact
source: Affected mistakes
ja: 影響を受けた問題
ko: 영향받은 오답
zh_hans: 影响错题
zh_hant: 影響錯題

# knowledge.fault.metric.recurrence
source: Recent recurrences
ja: 最近の再発
ko: 최근 재발
zh_hans: 最近复发
zh_hant: 最近復發

# knowledge.fault.metric.risk
source: Risk
ja: リスク
ko: 위험도
zh_hans: 风险
zh_hant: 風險

# knowledge.fault.metric.subjects
source: Subjects
ja: 科目
ko: 과목
zh_hans: 涉及学科
zh_hant: 涉及學科

# knowledge.fault.metrics.section
source: Fault-line profile
ja: 断層の概要
ko: 단절 프로필
zh_hans: 断层画像
zh_hant: 斷層画像

# knowledge.fault.navigation.title
source: Knowledge Fault Lines
ja: 知識の断層スキャン
ko: 지식 단절 스캔
zh_hans: 知识断层扫描
zh_hant: 知識斷層掃描

# knowledge.fault.overview.description
source: Repeated errors can point to a missing prerequisite, not just a single wrong answer.
ja: 繰り返す間違いは、一問の問題ではなく前提概念の不足を示すことがあります。
ko: 반복되는 오답은 한 문제의 실수보다 선행 개념의 부족을 나타낼 수 있습니다.
zh_hans: 反复出错可能不是一道题的问题，而是某个前置概念还没有稳固。
zh_hant: 反覆出錯可能不是一道題的問題，而是某個前置概念還不穩固。

# knowledge.fault.overview.header
source: Look beneath the mistake
ja: 間違いの奥にある原因を見る
ko: 오답 아래의 원인을 살펴보세요
zh_hans: 看看错误背后的底层原因
zh_hant: 看看錯誤背後的底層原因

# knowledge.fault.overview.section
source: Repeated fault lines
ja: 頻出する知識の断層
ko: 자주 나타나는 지식 단절
zh_hans: 高频知识断层
zh_hant: 高頻知識斷層

# knowledge.fault.related.meta
source: %@ · Mastery %d%%
ja: %@ · 習熟度 %d%%
ko: %@ · 숙련도 %d%%
zh_hans: %@ · 掌握度 %d%%
zh_hant: %@ · 掌握度 %d%%

# knowledge.fault.related.section
source: Related mistakes
ja: 関連する間違い
ko: 관련 오답
zh_hans: 相关错题
zh_hant: 相關錯題

# knowledge.fault.repair.action
source: Create a 15-minute repair task
ja: 15 分の基礎修復タスクを作成
ko: 15분 기초 복구 과제 만들기
zh_hans: 生成 15 分钟基础修复任务
zh_hant: 生成 15 分鐘基礎修復任務

# knowledge.fault.retry
source: Retry AI
ja: AI を再試行
ko: AI 다시 시도
zh_hans: 重试 AI
zh_hant: 重試 AI

# knowledge.fault.row.summary
source: %d mistakes · %@
ja: %d 問 · %@
ko: 오답 %d개 · %@
zh_hans: %d 道错题 · %@
zh_hant: %d 道錯題 · %@

# knowledge.fault.task.defaultNotes
source: 15-minute repair: review %@ and rebuild %@ step by step.
ja: 15 分の修復：%@ を復習し、%@ を一つずつ組み立て直します。
ko: 15분 복구: %@을(를) 복습하고 %@을(를) 단계별로 다시 구성하세요.
zh_hans: 15 分钟修复：复习 %@，并逐步重建 %@。
zh_hant: 15 分鐘修復：複習 %@，並逐步重建 %@。

# knowledge.fault.task.defaultTitle
source: Repair: %@
ja: 修復：%@
ko: 복구: %@
zh_hans: 修复：%@
zh_hant: 修復：%@

# knowledge.fault.task.notes
source: Notes
ja: メモ
ko: 메모
zh_hans: 备注
zh_hant: 備註

# knowledge.fault.task.section
source: Repair task
ja: 修復タスク
ko: 복구 과제
zh_hans: 修复任务
zh_hant: 修復任務

# knowledge.fault.task.title
source: Task title
ja: タスクのタイトル
ko: 과제 제목
zh_hans: 任务标题
zh_hant: 任務標題

# knowledge.fault.uncategorized
source: Uncategorized
ja: 未分類
ko: 분류 없음
zh_hans: 未分类
zh_hant: 未分類

source: Landscape Focus Mode
ja: 横向き集中モード
ko: 가로 집중 모드
zh_hans: 横屏专注模式
zh_hant: 橫屏專注模式

source: Language
ja: 言語
ko: 언어
zh_hans: 语言
zh_hant: 語言

source: Language · Theme · Home · Widget
ja: 言語 · テーマ · ホーム · ウィジェット
ko: 언어 · 테마 · 홈 · 위젯
zh_hans: 语言 · 主题 · 主页 · 小组件
zh_hant: 語言 · 主題 · 主頁 · 小工具

source: Language changes require app restart to take full effect.
ja: 言語の変更はアプリを再起動すると完全に反映されます
ko: 언어 변경은 앱을 재시작해야 완전히 적용됩니다
zh_hans: 语言更改需要重启应用才能完全生效
zh_hant: 語言變更需要重新啟動應用程式才能完全生效

source: Last %@
ja: 前回 %@
ko: 최근 %@
zh_hans: 最近 %@
zh_hant: 最近 %@

source: Last %d
ja: 前回 %d
ko: 최근 %d
zh_hans: 最近 %d
zh_hant: 最近 %d

source: Last 5 Hours
ja: 直近 5 時間
ko: 최근 5시간
zh_hans: 最近 5 小时
zh_hant: 最近 5 小時

source: Last 7 Days
ja: 直近 7 日間
ko: 최근 7일
zh_hans: 最近 7 天
zh_hant: 最近 7 天

source: Last 30 Days
ja: 過去30日間
ko: 최근 30일
zh_hans: 最近 30 天
zh_hant: 最近 30 天

source: Last 90 Days
ja: 過去 90 日間
ko: 지난 90 일
zh_hans: 最近 90 天
zh_hant: 最近 90 天

source: Last backup
ja: 前回のバックアップ
ko: 최근 백업
zh_hans: 最近一次备份
zh_hant: 最近一次備份

source: Last exam may have been affected by special factors (illness, bad day, etc.). Treat the prediction with extra caution.
ja: 前回の試験は特別な要因(体調不良や当日の調子など)の影響を受けた可能性があります。予測結果は参考程度にご覧ください。
ko: 최근 시험은 특수한 요인(몸살, 컨디션 저하 등)의 영향을 받았을 수 있습니다. 예측 결과는 참고용으로만 보세요.
zh_hans: 最近一次考试可能受特殊因素影响(身体不适、当天状态不佳等),预测结果仅供参考,请谨慎对待。
zh_hant: 最近一次考試可能受特殊因素影響(身體不適、當天狀態不佳等),預測結果僅供參考,請謹慎對待。

source: Last night's sleep
ja: 昨夜の睡眠
ko: 어젯밤 수면
zh_hans: 昨晚睡眠
zh_hant: 昨晚睡眠

# Lastest Grade
source: Latest Grade
ja: 最新の成績
ko: 최근 성적
zh_hans: 最新成绩
zh_hant: 最新成績

source: Later
ja: あとで
ko: 나중에
zh_hans: 后续
zh_hant: 稍後

source: Latest
ja: 最新
ko: 최신
zh_hans: 最新
zh_hant: 最新

source: Learn About Health Monitoring
ja: 健康モニタリングについて
ko: 건강 모니터링 알아보기
zh_hans: 了解健康监测
zh_hant: 了解健康監測

source: Learning Heatmap
ja: 学習ヒートマップ
ko: 학습 히트맵
zh_hans: 学习热力图
zh_hant: 學習熱力圖

source: Learning Reports
ja: 学習レポート
ko: 학습 보고서
zh_hans: 学习报告
zh_hant: 學習報告

source: Leave blank if you prefer to stay anonymous.
ja: 匿名で使いたい場合は空欄でも OK。
ko: 익명으로 사용하려면 비워 두세요.
zh_hans: 如果想保持匿名，可以留空。
zh_hant: 如想保持匿名，可留空。

source: Legal Code (English Summary)
ja: 法本文（英語概要）
ko: 법적 본문 (영문 요약)
zh_hans: 法律文本（英文概要）
zh_hant: 法律全文（英文概要）

source: Less than 6 hours of sleep — keep today's study light. Review notes and avoid new hard material; aim to sleep earlier tonight.
ja: 睡眠時間が 6 時間未満です。今日の学習は軽めに。ノート復習にとどめ、新しい難題は避け、今夜は早めに就寝しましょう。
ko: 6시간 미만 수면입니다. 오늘은 가볍게 공부하세요. 노트 복습만 하고 새로운 어려운 내용은 피하고, 오늘 밤은 일찍 잠자리에 듭시다.
zh_hans: 睡眠不足 6 小时——今天的学习要轻松一些。复习笔记就好，避免接触新内容；今晚记得早点睡。
zh_hant: 睡眠不足 6 小時——今天的學習要輕鬆一些。複習筆記就好，避免接觸新內容；今晚記得早點睡。

source: Library
ja: ライブラリ
ko: 보관함
zh_hans: 相册
zh_hant: 相簿

source: License Details
ja: ライセンスの詳細
ko: 라이선스 상세
zh_hans: 许可详情
zh_hant: 授權詳情

source: Light
ja: ライト
ko: 라이트
zh_hans: 浅色
zh_hant: 淺色

source: Light Review
ja: ライトレビュー
ko: 가벼운 복습
zh_hans: 轻量复习
zh_hant: 輕量複習

source: Lightning Fast
ja: 超高速
ko: 초고속
zh_hans: 毫秒级响应
zh_hant: 毫秒級回應

source: Limited time
ja: 残り時間が少ない
ko: 남은 시간 부족
zh_hans: 剩余时间不足
zh_hant: 剩餘時間不足

source: Line Chart
ja: 折れ線グラフ
ko: 꺾은선 차트
zh_hans: 折线图
zh_hant: 折線圖

source: Linear Regression
ja: 線形回帰
ko: 선형 회귀
zh_hans: 线性回归
zh_hant: 線性回歸

source: Link unassigned grades, mistakes, exams, and tasks to this phase.
ja: 未分類の成績・間違い・試験・タスクをこのフェーズに紐付けます。
ko: 분류되지 않은 성적·오답·시험·과제를 이 단계에 연결합니다.
zh_hans: 把未归类的成绩、错题、考试和任务关联到本阶段。
zh_hant: 把未歸類的成績、錯題、考試和任務關聯到本階段。

source: Linked Mistakes
ja: 関連ミス
ko: 관련 오답
zh_hans: 关联的错题
zh_hant: 關聯的錯題

source: Liquid Glass Effect
ja: リキッドガラス効果
ko: 리퀴드 글래스 효과
zh_hans: 液态玻璃效果
zh_hant: 液態玻璃效果

source: List
ja: リスト
ko: 리스트
zh_hans: 列表
zh_hant: 列表

source: LLM Not Configured
ja: LLM が未設定です
ko: LLM이 설정되지 않음
zh_hans: 尚未配置 LLM
zh_hant: 尚未設定 LLM

source: LLM request timed out.
ja: LLM リクエストがタイムアウトしました。
ko: LLM 요청이 시간 초과되었습니다.
zh_hans: LLM 请求超时。
zh_hant: LLM 請求逾時。

source: LLM returned empty content.
ja: LLM が空のコンテンツを返しました。
ko: LLM이 빈 콘텐츠를 반환했습니다.
zh_hans: LLM 返回内容为空。
zh_hant: LLM 回傳內容為空。

source: Loading...
ja: 読み込み中…
ko: 불러오는 중…
zh_hans: 加载中…
zh_hant: 載入中…

source: Local Fallback
ja: ローカルルール表示
ko: 로컬 규칙 보기
zh_hans: 本地规则视图
zh_hant: 本地規則視圖

source: Local regression, no network required.
ja: ローカル回帰、ネットワーク不要。
ko: 로컬 회귀, 네트워크 불필요.
zh_hans: 本地回归,无需联网。
zh_hant: 本地回歸,無需連線。

source: Log a test score for a subject.
ja: 科目のテストスコアを記録します。
ko: 과목의 시험 점수를 기록합니다.
zh_hans: 登记科目考试成绩。
zh_hant: 登記科目考試成績。

source: Log Export Success
ja: ログのエクスポートに成功
ko: 로그 내보내기 성공
zh_hans: 日志导出成功
zh_hant: 日誌匯出成功

source: Log Score
ja: スコアを記録
ko: 점수 기록
zh_hans: 登记成绩
zh_hant: 登記成績

source: Longest Streak
ja: 最長ストリーク
ko: 최장 스트릭
zh_hans: 最长连续
zh_hant: 最長連續

source: Low
ja: 低い
ko: 낮음
zh_hans: 偏低
zh_hant: 偏低

source: LOW
ja: 低
ko: 낮음
zh_hans: 低
zh_hant: 低

source: Low = well-recovered, primed for deep work. High = tired or stressed, ease into the day.
ja: 低め = 回復良好、深い学習向き。高め = 疲労・ストレスあり、ゆっくり始めましょう。
ko: 낮음 = 회복良好, 딥 워크 적합. 높음 = 피곤·스트레스, 오늘은 천천히.
zh_hans: 偏低 = 恢复良好，适合深度学习；偏高 = 疲劳或压力大，今天悠着来。
zh_hant: 偏低 = 恢復良好，適合深度學習；偏高 = 疲勞或壓力大，今天悠著來。

source: Low HRV → stressed, fatigued, needs recovery
ja: HRV が低い → ストレス・疲労があり、回復が必要
ko: HRV 낮음 → 스트레스, 피로, 회복 필요
zh_hans: HRV 低 → 压力较大、疲劳，需要恢复
zh_hant: HRV 低 → 壓力較大、疲勞，需要恢復

source: Low recovery
ja: 回復度が低い
ko: 회복 상태 낮음
zh_hans: 身体恢复较低
zh_hant: 身體恢復較低

source: Lowest
ja: 最低
ko: 최저
zh_hans: 最低
zh_hant: 最低

source: M=%d%%
ja: 習得度 %d%%
ko: 숙지도 %d%%
zh_hans: 掌握度 %d%%
zh_hant: 掌握度 %d%%

source: Main Node
ja: 中心ノード
ko: 중심 노드
zh_hans: 中心节点
zh_hant: 中心節點

source: Male
ja: 男性
ko: 남성
zh_hans: 男
zh_hant: 男

source: Manual
ja: 手動設定
ko: 수동 설정
zh_hans: 手动设置
zh_hant: 手動設定

source: Manual Generation
ja: 手動生成
ko: 수동 생성
zh_hans: 手动生成
zh_hant: 手動產生

source: Manual Quotas
ja: 手動目標量
ko: 수동 할당량
zh_hans: 手动额度
zh_hant: 手動額度

source: Mark complete
ja: 完了にする
ko: 완료로 표시
zh_hans: 标记完成
zh_hant: 標記完成

source: Mark Completed
ja: 完了にする
ko: 완료로 표시
zh_hans: 标记完成
zh_hant: 標記完成

source: Mark Pending
ja: 未完了に戻す
ko: 미완료로 표시
zh_hans: 标记未完成
zh_hant: 標記未完成

# markdown.cmd.blockMath
source: Block Math
ja: ブロック数式
ko: 블록 수식
zh_hans: 行间公式
zh_hant: 行間公式

# markdown.cmd.bold
source: Bold
ja: 太字
ko: 굵게
zh_hans: 粗体
zh_hant: 粗體

# markdown.cmd.bulletList
source: Bulleted List
ja: 箇条書き
ko: 글머리 기호 목록
zh_hans: 无序列表
zh_hant: 無序列表

# markdown.cmd.checklist
source: Checklist
ja: チェックリスト
ko: 체크리스트
zh_hans: 待办
zh_hant: 待辦

# markdown.cmd.codeBlock
source: Code Block
ja: コードブロック
ko: 코드 블록
zh_hans: 代码块
zh_hant: 程式碼區塊

# markdown.cmd.divider
source: Divider
ja: 区切り線
ko: 구분선
zh_hans: 分隔线
zh_hant: 分隔線

# markdown.cmd.h1
source: Heading 1
ja: 見出し 1
ko: 제목 1
zh_hans: 一级标题
zh_hant: 一級標題

# markdown.cmd.h2
source: Heading 2
ja: 見出し 2
ko: 제목 2
zh_hans: 二级标题
zh_hant: 二級標題

# markdown.cmd.h3
source: Heading 3
ja: 見出し 3
ko: 제목 3
zh_hans: 三级标题
zh_hant: 三級標題

# markdown.cmd.h4
source: Heading 4
ja: 見出し 4
ko: 제목 4
zh_hans: 四级标题
zh_hant: 四級標題

# markdown.cmd.h5
source: Heading 5
ja: 見出し 5
ko: 제목 5
zh_hans: 五级标题
zh_hant: 五級標題

# markdown.cmd.h6
source: Heading 6
ja: 見出し 6
ko: 제목 6
zh_hans: 六级标题
zh_hant: 六級標題

# markdown.cmd.inlineCode
source: Inline Code
ja: インラインコード
ko: 인라인 코드
zh_hans: 行内代码
zh_hant: 行內程式碼

# markdown.cmd.inlineMath
source: Inline Math
ja: インライン数式
ko: 인라인 수식
zh_hans: 行内公式
zh_hant: 行內公式

# markdown.cmd.italic
source: Italic
ja: 斜体
ko: 기울임꼴
zh_hans: 斜体
zh_hant: 斜體

# markdown.cmd.link
source: Link
ja: リンク
ko: 링크
zh_hans: 链接
zh_hant: 連結

# markdown.cmd.numberedList
source: Numbered List
ja: 番号付きリスト
ko: 번호 매기기 목록
zh_hans: 有序列表
zh_hant: 有序列表

# markdown.cmd.quote
source: Quote
ja: 引用
ko: 인용
zh_hans: 引用
zh_hant: 引用

# markdown.menu.format
source: Format
ja: 書式
ko: 서식
zh_hans: 格式
zh_hant: 格式

# markdown.menu.view
source: View
ja: 表示
ko: 보기
zh_hans: 视图
zh_hant: 檢視

# markdown.view.togglePreview
source: Toggle Preview
ja: プレビュー切替
ko: 미리보기 전환
zh_hans: 切换预览
zh_hant: 切換預覽

# markdown.view.toggleVertical
source: Vertical Layout
ja: 上下分割
ko: 상하 분할
zh_hans: 上下分栏
zh_hant: 上下分欄
